{
    "projects": [
        {
            "id": 1,
            "name": "Expenses Manager",
            "description": "Built because I wanted to learn React and also needed an organized way to see where my monthly expenses were going.<br>Made a JSON parser, which takes a <em><strong>TD Canada bank statement</strong></em>, which it then categorizes based on predefined expense categories.<br>Planning on rebuilding this into a more robust application with Vue.js, to add a back-end, and to allow for more user customization as well as user authentication.",
            "stack": ["ReactJS", "Github Pages"],
            "url": "https://sebastianrubina.github.io/FinancesManager/",
            "github": "https://github.com/SebastianRubina/FinancesManager"
        },
        {
            "id": 2,
            "name": "Full Stack ToDo Application",
            "description": "My first adventure into full stack development.<br>Built for the learning new technologies which I will be using for an upcoming job.<br>Wanted to take a different approach than what I usually do when I am learning something, which is watching videos and tutorials. I thought it was time to move past that, built this entirely on my own and recurring to documentation when needed.<br><em>Note: pushing new items to the database has been disabled to stop the application from persisting any inappropriate messages that peoplep may add.</em>",
            "stack": ["Vue.js", "ASP.NET Core", "PostgreSQL", "Azure"],
            "url": "https://superlative-alpaca-bca84c.netlify.app/",
            "github": "https://github.com/SebastianRubina/Todo-FullStack"
        },
        {
            "id": 3,
            "name": "Portfolio Website Terminal",
            "description": "The current website you are visiting!<br>Wanted to build something minimalistic-looking, but also different from what I had seen other people do.<br>I wanted it to be a challenge, so that it would better allow me to improve with and put my Vue.js skills to the test.",
            "stack": ["Vue.js"],
            "url": "https://sebastianrubina.com/",
            "github": "https://github.com/SebastianRubina/Portfolio"
        }
    ]
}